IDEA Open Model
HangingAroundPatch.Diameter Property
Compatible with IDEA StatiCa v 10.1
 Diameter o reinforcement
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 10.1.0.1 (10.1.0.1)
Syntax
public double Diameter { get; set; }
Public Property Diameter As Double
	Get
	Set
public:
property double Diameter {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
HangingAroundPatch Class
IdeaRS.OpenModel.Detail Namespace